In [27]:
import pandas
import datetime

In [2]:
df = pandas.read_csv('quakesT.csv')

In [3]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3,1964-02-24T23:30:25.0Z
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7,1964-04-11T16:00:00.0Z
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5,1964-04-21T08:14:40.0Z
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0,1964-04-24T03:49:58.0Z
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8,1964-04-29T04:21:00.0Z
...,...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6,2021-04-09T05:00:07.4Z
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5,2021-04-09T05:00:21.9Z
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0,2021-04-09T05:01:06.5Z
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0,2021-04-09T05:02:05.6Z
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2,2021-04-09T05:15:05.0Z

In [4]:
df.dtypes

YEAR           int64
MONTH         object
DAY            int64
HOUR           int64
MINUTE         int64
SECOND       float64
LATITUDE     float64
LONGITUDE    float64
DEPTH          int64
MAGNITUDE    float64
T             object
dtype: object

In [5]:
df.shape

(313400, 11)

In [6]:
fltr = (df['YEAR'] < 2000) | (df['YEAR'] > 2009)

In [7]:
df.drop(df[fltr].index, inplace=True)

In [8]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T
36096,2000,JAN,1,1,19,28.3,41.95,20.63,5,4.8,2000-01-01T01:19:28.3Z
36097,2000,JAN,1,4,2,28.4,35.54,22.76,22,3.7,2000-01-01T04:02:28.4Z
36098,2000,JAN,1,5,13,59.1,38.97,26.10,35,3.3,2000-01-01T05:13:59.1Z
36099,2000,JAN,1,5,17,12.9,38.89,25.85,22,3.3,2000-01-01T05:17:12.9Z
36100,2000,JAN,1,5,56,7.3,39.21,27.30,10,3.6,2000-01-01T05:56:07.3Z
...,...,...,...,...,...,...,...,...,...,...,...
88348,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31T14:24:01.2Z
88349,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31T14:50:29.6Z
88350,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31T17:27:45.8Z
88351,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31T20:43:12.9Z
88352,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31T20:58:40.8Z

In [9]:
df.reset_index(inplace=True)

In [12]:
df.drop(columns='index', inplace=True)

In [13]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T
0,2000,JAN,1,1,19,28.3,41.95,20.63,5,4.8,2000-01-01T01:19:28.3Z
1,2000,JAN,1,4,2,28.4,35.54,22.76,22,3.7,2000-01-01T04:02:28.4Z
2,2000,JAN,1,5,13,59.1,38.97,26.10,35,3.3,2000-01-01T05:13:59.1Z
3,2000,JAN,1,5,17,12.9,38.89,25.85,22,3.3,2000-01-01T05:17:12.9Z
4,2000,JAN,1,5,56,7.3,39.21,27.30,10,3.6,2000-01-01T05:56:07.3Z
...,...,...,...,...,...,...,...,...,...,...,...
52252,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31T14:24:01.2Z
52253,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31T14:50:29.6Z
52254,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31T17:27:45.8Z
52255,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31T20:43:12.9Z
52256,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31T20:58:40.8Z

currently we are reading it as a string

In [14]:
df['DATETIME'] = pandas.to_datetime(df['T'])

In [16]:
df['DATETIME']

0       2000-01-01 01:19:28.300000+00:00
1       2000-01-01 04:02:28.400000+00:00
2       2000-01-01 05:13:59.100000+00:00
3       2000-01-01 05:17:12.900000+00:00
4       2000-01-01 05:56:07.300000+00:00
                      ...
52252   2009-12-31 14:24:01.200000+00:00
52253   2009-12-31 14:50:29.600000+00:00
52254   2009-12-31 17:27:45.800000+00:00
52255   2009-12-31 20:43:12.900000+00:00
52256   2009-12-31 20:58:40.800000+00:00
Name: DATETIME, Length: 52257, dtype: datetime64[ns, UTC]

In [18]:
df.loc[0, 'DATETIME'].day_name()

'Saturday'

In [19]:
df_full = pandas.read_csv('quakesT.csv', parse_dates=['T'])

In [20]:
df_full

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3,1964-02-24 23:30:25+00:00
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7,1964-04-11 16:00:00+00:00
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5,1964-04-21 08:14:40+00:00
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0,1964-04-24 03:49:58+00:00
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8,1964-04-29 04:21:00+00:00
...,...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6,2021-04-09 05:00:07.400000+00:00
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5,2021-04-09 05:00:21.900000+00:00
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0,2021-04-09 05:01:06.500000+00:00
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0,2021-04-09 05:02:05.600000+00:00
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2,2021-04-09 05:15:05+00:00

In [22]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DATETIME
0,2000,JAN,1,1,19,28.3,41.95,20.63,5,4.8,2000-01-01T01:19:28.3Z,2000-01-01 01:19:28.300000+00:00
1,2000,JAN,1,4,2,28.4,35.54,22.76,22,3.7,2000-01-01T04:02:28.4Z,2000-01-01 04:02:28.400000+00:00
2,2000,JAN,1,5,13,59.1,38.97,26.10,35,3.3,2000-01-01T05:13:59.1Z,2000-01-01 05:13:59.100000+00:00
3,2000,JAN,1,5,17,12.9,38.89,25.85,22,3.3,2000-01-01T05:17:12.9Z,2000-01-01 05:17:12.900000+00:00
4,2000,JAN,1,5,56,7.3,39.21,27.30,10,3.6,2000-01-01T05:56:07.3Z,2000-01-01 05:56:07.300000+00:00
...,...,...,...,...,...,...,...,...,...,...,...,...
52252,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31T14:24:01.2Z,2009-12-31 14:24:01.200000+00:00
52253,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31T14:50:29.6Z,2009-12-31 14:50:29.600000+00:00
52254,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31T17:27:45.8Z,2009-12-31 17:27:45.800000+00:00
52255,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31T20:43:12.9Z,2009-12-31 20:43:12.900000+00:00
52256,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31T20:58:40.8Z,2009-12-31 20:58:40.800000+00:00

In [32]:
df['DATETIME'].dt.day_name()

0        Saturday
1        Saturday
2        Saturday
3        Saturday
4        Saturday
           ...
52252    Thursday
52253    Thursday
52254    Thursday
52255    Thursday
52256    Thursday
Name: DATETIME, Length: 52257, dtype: object

In [33]:
df['DAY_NAME'] = df['DATETIME'].dt.day_name()

In [34]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DATETIME,DAY_NAME
0,2000,JAN,1,1,19,28.3,41.95,20.63,5,4.8,2000-01-01T01:19:28.3Z,2000-01-01 01:19:28.300000+00:00,Saturday
1,2000,JAN,1,4,2,28.4,35.54,22.76,22,3.7,2000-01-01T04:02:28.4Z,2000-01-01 04:02:28.400000+00:00,Saturday
2,2000,JAN,1,5,13,59.1,38.97,26.10,35,3.3,2000-01-01T05:13:59.1Z,2000-01-01 05:13:59.100000+00:00,Saturday
3,2000,JAN,1,5,17,12.9,38.89,25.85,22,3.3,2000-01-01T05:17:12.9Z,2000-01-01 05:17:12.900000+00:00,Saturday
4,2000,JAN,1,5,56,7.3,39.21,27.30,10,3.6,2000-01-01T05:56:07.3Z,2000-01-01 05:56:07.300000+00:00,Saturday
...,...,...,...,...,...,...,...,...,...,...,...,...,...
52252,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31T14:24:01.2Z,2009-12-31 14:24:01.200000+00:00,Thursday
52253,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31T14:50:29.6Z,2009-12-31 14:50:29.600000+00:00,Thursday
52254,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31T17:27:45.8Z,2009-12-31 17:27:45.800000+00:00,Thursday
52255,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31T20:43:12.9Z,2009-12-31 20:43:12.900000+00:00,Thursday
52256,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31T20:58:40.8Z,2009-12-31 20:58:40.800000+00:00,Thursday

In [35]:
df.dtypes

YEAR                       int64
MONTH                     object
DAY                        int64
HOUR                       int64
MINUTE                     int64
SECOND                   float64
LATITUDE                 float64
LONGITUDE                float64
DEPTH                      int64
MAGNITUDE                float64
T                         object
DATETIME     datetime64[ns, UTC]
DAY_NAME                  object
dtype: object

In [40]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DATETIME,DAY_NAME
0,2000,JAN,1,1,19,28.3,41.95,20.63,5,4.8,2000-01-01T01:19:28.3Z,2000-01-01 01:19:28.300000+00:00,Saturday
1,2000,JAN,1,4,2,28.4,35.54,22.76,22,3.7,2000-01-01T04:02:28.4Z,2000-01-01 04:02:28.400000+00:00,Saturday
2,2000,JAN,1,5,13,59.1,38.97,26.10,35,3.3,2000-01-01T05:13:59.1Z,2000-01-01 05:13:59.100000+00:00,Saturday
3,2000,JAN,1,5,17,12.9,38.89,25.85,22,3.3,2000-01-01T05:17:12.9Z,2000-01-01 05:17:12.900000+00:00,Saturday
4,2000,JAN,1,5,56,7.3,39.21,27.30,10,3.6,2000-01-01T05:56:07.3Z,2000-01-01 05:56:07.300000+00:00,Saturday
...,...,...,...,...,...,...,...,...,...,...,...,...,...
52252,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31T14:24:01.2Z,2009-12-31 14:24:01.200000+00:00,Thursday
52253,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31T14:50:29.6Z,2009-12-31 14:50:29.600000+00:00,Thursday
52254,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31T17:27:45.8Z,2009-12-31 17:27:45.800000+00:00,Thursday
52255,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31T20:43:12.9Z,2009-12-31 20:43:12.900000+00:00,Thursday
52256,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31T20:58:40.8Z,2009-12-31 20:58:40.800000+00:00,Thursday

In [38]:
df.dtypes

YEAR                       int64
MONTH                     object
DAY                        int64
HOUR                       int64
MINUTE                     int64
SECOND                   float64
LATITUDE                 float64
LONGITUDE                float64
DEPTH                      int64
MAGNITUDE                float64
T                         object
DATETIME     datetime64[ns, UTC]
DAY_NAME                  object
dtype: object

how to see the earliest and latest dates

In [41]:
df['DATETIME'].min()

Timestamp('2000-01-01 01:19:28.300000+0000', tz='UTC')

In [42]:
df['DATETIME'].max()

Timestamp('2009-12-31 20:58:40.800000+0000', tz='UTC')

In [44]:
df['DATETIME'].max() - df['DATETIME'].min()

Timedelta('3652 days 19:39:12.500000')

now we can create groups

In [50]:
filt = (df['DATETIME'] >= '2004') & (df['DATETIME'] < '2005')
df.loc[filt]

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DATETIME,DAY_NAME
10316,2004,JAN,1,0,32,1.3,37.76,21.07,5,3.4,2004-01-01T00:32:01.3Z,2004-01-01 00:32:01.300000+00:00,Thursday
10317,2004,JAN,1,1,43,44.0,38.38,21.54,42,3.1,2004-01-01T01:43:44.0Z,2004-01-01 01:43:44+00:00,Thursday
10318,2004,JAN,1,3,14,36.4,38.54,20.64,5,3.3,2004-01-01T03:14:36.4Z,2004-01-01 03:14:36.400000+00:00,Thursday
10319,2004,JAN,1,7,7,4.8,34.35,25.47,24,3.9,2004-01-01T07:07:04.8Z,2004-01-01 07:07:04.800000+00:00,Thursday
10320,2004,JAN,1,9,7,47.8,38.39,21.89,5,3.0,2004-01-01T09:07:47.8Z,2004-01-01 09:07:47.800000+00:00,Thursday
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13750,2004,DEC,31,13,59,59.9,37.11,28.24,18,3.6,2004-12-31T13:59:59.9Z,2004-12-31 13:59:59.900000+00:00,Friday
13751,2004,DEC,31,14,29,28.3,40.49,22.38,32,3.3,2004-12-31T14:29:28.3Z,2004-12-31 14:29:28.300000+00:00,Friday
13752,2004,DEC,31,16,3,25.1,38.44,19.75,12,3.4,2004-12-31T16:03:25.1Z,2004-12-31 16:03:25.100000+00:00,Friday
13753,2004,DEC,31,20,43,25.8,37.32,20.19,8,3.6,2004-12-31T20:43:25.8Z,2004-12-31 20:43:25.800000+00:00,Friday
13754,2004,DEC,31,20,50,54.1,38.92,21.08,10,2.7,2004-12-31T20:50:54.1Z,2004-12-31 20:50:54.100000+00:00,Friday

In [66]:
filt = (df['DATETIME'] >= pandas.to_datetime('2004-01-01T00:00:00Z')) & (df['DATETIME'] < pandas.to_datetime('2005-01-01T00:00:00Z'))
df[filt]

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DATETIME,DAY_NAME
10316,2004,JAN,1,0,32,1.3,37.76,21.07,5,3.4,2004-01-01T00:32:01.3Z,2004-01-01 00:32:01.300000+00:00,Thursday
10317,2004,JAN,1,1,43,44.0,38.38,21.54,42,3.1,2004-01-01T01:43:44.0Z,2004-01-01 01:43:44+00:00,Thursday
10318,2004,JAN,1,3,14,36.4,38.54,20.64,5,3.3,2004-01-01T03:14:36.4Z,2004-01-01 03:14:36.400000+00:00,Thursday
10319,2004,JAN,1,7,7,4.8,34.35,25.47,24,3.9,2004-01-01T07:07:04.8Z,2004-01-01 07:07:04.800000+00:00,Thursday
10320,2004,JAN,1,9,7,47.8,38.39,21.89,5,3.0,2004-01-01T09:07:47.8Z,2004-01-01 09:07:47.800000+00:00,Thursday
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13750,2004,DEC,31,13,59,59.9,37.11,28.24,18,3.6,2004-12-31T13:59:59.9Z,2004-12-31 13:59:59.900000+00:00,Friday
13751,2004,DEC,31,14,29,28.3,40.49,22.38,32,3.3,2004-12-31T14:29:28.3Z,2004-12-31 14:29:28.300000+00:00,Friday
13752,2004,DEC,31,16,3,25.1,38.44,19.75,12,3.4,2004-12-31T16:03:25.1Z,2004-12-31 16:03:25.100000+00:00,Friday
13753,2004,DEC,31,20,43,25.8,37.32,20.19,8,3.6,2004-12-31T20:43:25.8Z,2004-12-31 20:43:25.800000+00:00,Friday
13754,2004,DEC,31,20,50,54.1,38.92,21.08,10,2.7,2004-12-31T20:50:54.1Z,2004-12-31 20:50:54.100000+00:00,Friday

## REMOVE TIMEZONE

In [74]:
df['DATETIME'] = df['DATETIME'].dt.tz_convert(None)

In [75]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DATETIME,DAY_NAME
0,2000,JAN,1,1,19,28.3,41.95,20.63,5,4.8,2000-01-01T01:19:28.3Z,2000-01-01 01:19:28.300,Saturday
1,2000,JAN,1,4,2,28.4,35.54,22.76,22,3.7,2000-01-01T04:02:28.4Z,2000-01-01 04:02:28.400,Saturday
2,2000,JAN,1,5,13,59.1,38.97,26.10,35,3.3,2000-01-01T05:13:59.1Z,2000-01-01 05:13:59.100,Saturday
3,2000,JAN,1,5,17,12.9,38.89,25.85,22,3.3,2000-01-01T05:17:12.9Z,2000-01-01 05:17:12.900,Saturday
4,2000,JAN,1,5,56,7.3,39.21,27.30,10,3.6,2000-01-01T05:56:07.3Z,2000-01-01 05:56:07.300,Saturday
...,...,...,...,...,...,...,...,...,...,...,...,...,...
52252,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31T14:24:01.2Z,2009-12-31 14:24:01.200,Thursday
52253,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31T14:50:29.6Z,2009-12-31 14:50:29.600,Thursday
52254,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31T17:27:45.8Z,2009-12-31 17:27:45.800,Thursday
52255,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31T20:43:12.9Z,2009-12-31 20:43:12.900,Thursday
52256,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31T20:58:40.8Z,2009-12-31 20:58:40.800,Thursday

set index to datetime

In [77]:
df.set_index('DATETIME', inplace=True)

In [78]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DAY_NAME
DATETIME,,,,,,,,,,,,
2000-01-01 01:19:28.300,2000,JAN,1,1,19,28.3,41.95,20.63,5,4.8,2000-01-01T01:19:28.3Z,Saturday
2000-01-01 04:02:28.400,2000,JAN,1,4,2,28.4,35.54,22.76,22,3.7,2000-01-01T04:02:28.4Z,Saturday
2000-01-01 05:13:59.100,2000,JAN,1,5,13,59.1,38.97,26.10,35,3.3,2000-01-01T05:13:59.1Z,Saturday
2000-01-01 05:17:12.900,2000,JAN,1,5,17,12.9,38.89,25.85,22,3.3,2000-01-01T05:17:12.9Z,Saturday
2000-01-01 05:56:07.300,2000,JAN,1,5,56,7.3,39.21,27.30,10,3.6,2000-01-01T05:56:07.3Z,Saturday
...,...,...,...,...,...,...,...,...,...,...,...,...
2009-12-31 14:24:01.200,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31T14:24:01.2Z,Thursday
2009-12-31 14:50:29.600,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31T14:50:29.6Z,Thursday
2009-12-31 17:27:45.800,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31T17:27:45.8Z,Thursday
2009-12-31 20:43:12.900,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31T20:43:12.9Z,Thursday
2009-12-31 20:58:40.800,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31T20:58:40.8Z,Thursday

In [87]:
df.loc['2004']

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DAY_NAME
DATETIME,,,,,,,,,,,,
2004-01-01 00:32:01.300,2004,JAN,1,0,32,1.3,37.76,21.07,5,3.4,2004-01-01T00:32:01.3Z,Thursday
2004-01-01 01:43:44.000,2004,JAN,1,1,43,44.0,38.38,21.54,42,3.1,2004-01-01T01:43:44.0Z,Thursday
2004-01-01 03:14:36.400,2004,JAN,1,3,14,36.4,38.54,20.64,5,3.3,2004-01-01T03:14:36.4Z,Thursday
2004-01-01 07:07:04.800,2004,JAN,1,7,7,4.8,34.35,25.47,24,3.9,2004-01-01T07:07:04.8Z,Thursday
2004-01-01 09:07:47.800,2004,JAN,1,9,7,47.8,38.39,21.89,5,3.0,2004-01-01T09:07:47.8Z,Thursday
...,...,...,...,...,...,...,...,...,...,...,...,...
2004-12-31 13:59:59.900,2004,DEC,31,13,59,59.9,37.11,28.24,18,3.6,2004-12-31T13:59:59.9Z,Friday
2004-12-31 14:29:28.300,2004,DEC,31,14,29,28.3,40.49,22.38,32,3.3,2004-12-31T14:29:28.3Z,Friday
2004-12-31 16:03:25.100,2004,DEC,31,16,3,25.1,38.44,19.75,12,3.4,2004-12-31T16:03:25.1Z,Friday
2004-12-31 20:43:25.800,2004,DEC,31,20,43,25.8,37.32,20.19,8,3.6,2004-12-31T20:43:25.8Z,Friday
2004-12-31 20:50:54.100,2004,DEC,31,20,50,54.1,38.92,21.08,10,2.7,2004-12-31T20:50:54.1Z,Friday

In [88]:
df['2004']

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DAY_NAME
DATETIME,,,,,,,,,,,,
2004-01-01 00:32:01.300,2004,JAN,1,0,32,1.3,37.76,21.07,5,3.4,2004-01-01T00:32:01.3Z,Thursday
2004-01-01 01:43:44.000,2004,JAN,1,1,43,44.0,38.38,21.54,42,3.1,2004-01-01T01:43:44.0Z,Thursday
2004-01-01 03:14:36.400,2004,JAN,1,3,14,36.4,38.54,20.64,5,3.3,2004-01-01T03:14:36.4Z,Thursday
2004-01-01 07:07:04.800,2004,JAN,1,7,7,4.8,34.35,25.47,24,3.9,2004-01-01T07:07:04.8Z,Thursday
2004-01-01 09:07:47.800,2004,JAN,1,9,7,47.8,38.39,21.89,5,3.0,2004-01-01T09:07:47.8Z,Thursday
...,...,...,...,...,...,...,...,...,...,...,...,...
2004-12-31 13:59:59.900,2004,DEC,31,13,59,59.9,37.11,28.24,18,3.6,2004-12-31T13:59:59.9Z,Friday
2004-12-31 14:29:28.300,2004,DEC,31,14,29,28.3,40.49,22.38,32,3.3,2004-12-31T14:29:28.3Z,Friday
2004-12-31 16:03:25.100,2004,DEC,31,16,3,25.1,38.44,19.75,12,3.4,2004-12-31T16:03:25.1Z,Friday
2004-12-31 20:43:25.800,2004,DEC,31,20,43,25.8,37.32,20.19,8,3.6,2004-12-31T20:43:25.8Z,Friday
2004-12-31 20:50:54.100,2004,DEC,31,20,50,54.1,38.92,21.08,10,2.7,2004-12-31T20:50:54.1Z,Friday

specific range: with slice

In [89]:
df['2004-07':'2004-08']

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DAY_NAME
DATETIME,,,,,,,,,,,,
2004-07-01 05:35:36.300,2004,JUL,1,5,35,36.3,36.32,22.80,10,3.2,2004-07-01T05:35:36.3Z,Thursday
2004-07-01 06:33:10.800,2004,JUL,1,6,33,10.8,34.80,24.75,38,3.1,2004-07-01T06:33:10.8Z,Thursday
2004-07-01 07:13:28.000,2004,JUL,1,7,13,28.0,36.05,27.38,13,2.8,2004-07-01T07:13:28.0Z,Thursday
2004-07-01 08:41:04.800,2004,JUL,1,8,41,4.8,34.95,25.69,11,2.8,2004-07-01T08:41:04.8Z,Thursday
2004-07-01 10:49:59.800,2004,JUL,1,10,49,59.8,40.89,26.03,5,3.7,2004-07-01T10:49:59.8Z,Thursday
...,...,...,...,...,...,...,...,...,...,...,...,...
2004-08-31 09:51:48.800,2004,AUG,31,9,51,48.8,38.91,22.14,18,3.3,2004-08-31T09:51:48.8Z,Tuesday
2004-08-31 12:04:37.300,2004,AUG,31,12,4,37.3,35.02,25.82,13,3.0,2004-08-31T12:04:37.3Z,Tuesday
2004-08-31 13:38:22.400,2004,AUG,31,13,38,22.4,36.37,21.70,10,3.4,2004-08-31T13:38:22.4Z,Tuesday
2004-08-31 20:23:09.000,2004,AUG,31,20,23,9.0,38.56,23.49,4,2.6,2004-08-31T20:23:09.0Z,Tuesday
2004-08-31 21:26:45.900,2004,AUG,31,21,26,45.9,36.83,22.01,5,3.1,2004-08-31T21:26:45.9Z,Tuesday

let's say i want the median of earthquake magnitudes for the above time period

In [90]:
df['2004-07':'2004-08']['MAGNITUDE']

DATETIME
2004-07-01 05:35:36.300    3.2
2004-07-01 06:33:10.800    3.1
2004-07-01 07:13:28.000    2.8
2004-07-01 08:41:04.800    2.8
2004-07-01 10:49:59.800    3.7
                          ...
2004-08-31 09:51:48.800    3.3
2004-08-31 12:04:37.300    3.0
2004-08-31 13:38:22.400    3.4
2004-08-31 20:23:09.000    2.6
2004-08-31 21:26:45.900    3.1
Name: MAGNITUDE, Length: 802, dtype: float64

In [91]:
df['2004-07':'2004-08']['MAGNITUDE'].median()

3.2

In [92]:
df.loc['2004-07':'2004-08', 'MAGNITUDE']

DATETIME
2004-07-01 05:35:36.300    3.2
2004-07-01 06:33:10.800    3.1
2004-07-01 07:13:28.000    2.8
2004-07-01 08:41:04.800    2.8
2004-07-01 10:49:59.800    3.7
                          ...
2004-08-31 09:51:48.800    3.3
2004-08-31 12:04:37.300    3.0
2004-08-31 13:38:22.400    3.4
2004-08-31 20:23:09.000    2.6
2004-08-31 21:26:45.900    3.1
Name: MAGNITUDE, Length: 802, dtype: float64

In [93]:
df.loc['2004-07':'2004-08', 'MAGNITUDE'].median()

3.2

In [94]:
df.loc['2004-07':'2004-08', 'MAGNITUDE'].apply(lambda x: x+1)

DATETIME
2004-07-01 05:35:36.300    4.2
2004-07-01 06:33:10.800    4.1
2004-07-01 07:13:28.000    3.8
2004-07-01 08:41:04.800    3.8
2004-07-01 10:49:59.800    4.7
                          ...
2004-08-31 09:51:48.800    4.3
2004-08-31 12:04:37.300    4.0
2004-08-31 13:38:22.400    4.4
2004-08-31 20:23:09.000    3.6
2004-08-31 21:26:45.900    4.1
Name: MAGNITUDE, Length: 802, dtype: float64

In [115]:
df['COM'] = 1

In [116]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DAY_NAME,COM
DATETIME,,,,,,,,,,,,,
2000-01-01 01:19:28.300,2000,JAN,1,1,19,28.3,41.95,20.63,5,4.8,2000-01-01T01:19:28.3Z,Saturday,1
2000-01-01 04:02:28.400,2000,JAN,1,4,2,28.4,35.54,22.76,22,3.7,2000-01-01T04:02:28.4Z,Saturday,1
2000-01-01 05:13:59.100,2000,JAN,1,5,13,59.1,38.97,26.10,35,3.3,2000-01-01T05:13:59.1Z,Saturday,1
2000-01-01 05:17:12.900,2000,JAN,1,5,17,12.9,38.89,25.85,22,3.3,2000-01-01T05:17:12.9Z,Saturday,1
2000-01-01 05:56:07.300,2000,JAN,1,5,56,7.3,39.21,27.30,10,3.6,2000-01-01T05:56:07.3Z,Saturday,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2009-12-31 14:24:01.200,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31T14:24:01.2Z,Thursday,1
2009-12-31 14:50:29.600,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31T14:50:29.6Z,Thursday,1
2009-12-31 17:27:45.800,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31T17:27:45.8Z,Thursday,1
2009-12-31 20:43:12.900,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31T20:43:12.9Z,Thursday,1
2009-12-31 20:58:40.800,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31T20:58:40.8Z,Thursday,1

In [117]:
df['COM'].cumsum()

DATETIME
2000-01-01 01:19:28.300        1
2000-01-01 04:02:28.400        2
2000-01-01 05:13:59.100        3
2000-01-01 05:17:12.900        4
2000-01-01 05:56:07.300        5
                           ...
2009-12-31 14:24:01.200    52253
2009-12-31 14:50:29.600    52254
2009-12-31 17:27:45.800    52255
2009-12-31 20:43:12.900    52256
2009-12-31 20:58:40.800    52257
Name: COM, Length: 52257, dtype: int64

In [118]:
df['COM'] = df['COM'].cumsum()

In [119]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T,DAY_NAME,COM
DATETIME,,,,,,,,,,,,,
2000-01-01 01:19:28.300,2000,JAN,1,1,19,28.3,41.95,20.63,5,4.8,2000-01-01T01:19:28.3Z,Saturday,1
2000-01-01 04:02:28.400,2000,JAN,1,4,2,28.4,35.54,22.76,22,3.7,2000-01-01T04:02:28.4Z,Saturday,2
2000-01-01 05:13:59.100,2000,JAN,1,5,13,59.1,38.97,26.10,35,3.3,2000-01-01T05:13:59.1Z,Saturday,3
2000-01-01 05:17:12.900,2000,JAN,1,5,17,12.9,38.89,25.85,22,3.3,2000-01-01T05:17:12.9Z,Saturday,4
2000-01-01 05:56:07.300,2000,JAN,1,5,56,7.3,39.21,27.30,10,3.6,2000-01-01T05:56:07.3Z,Saturday,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2009-12-31 14:24:01.200,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31T14:24:01.2Z,Thursday,52253
2009-12-31 14:50:29.600,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31T14:50:29.6Z,Thursday,52254
2009-12-31 17:27:45.800,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31T17:27:45.8Z,Thursday,52255
2009-12-31 20:43:12.900,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31T20:43:12.9Z,Thursday,52256
2009-12-31 20:58:40.800,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31T20:58:40.8Z,Thursday,52257